[{"name":"isActive","description":"Any of the standard type options allowed by jjAddParticle: INACTIVE, FIRE, FLOWER, ICETRAIL, LEAF, PIXEL, RAIN, SMOKE, SNOW, SPARK, STAR, STRING, or TILE.\n","full":"bool isActivebool isActive","type":"property","arguments":[]},{"name":"type","description":"Horizontal speed in pixels, positive or negative.\n","full":"PARTICLE::Type typePARTICLE::Type typePARTICLE::Type type","type":"property","arguments":[]},{"name":"xPos","description":"Vertical speed in pixels, positive or negative.\n","full":"float xPosfloat xPos","type":"property","arguments":[]},{"name":"xSpeed","description":"uint8 fire.color is the color (palette entry) which a fire particle will be drawn as. This property gradually increases as the particle remains active, until it reaches colorStop (default 48, pink), at which point the particle will disappear. The default initial value is 40 (yellow).\nint8 fire.colorDelta is the rate at which the color property is going to change. The most commonly used values for this are 1 and -1 meaning that the color value will respectively increase or decrease by 1 every time the game decides to modify it. The default value is 1.\nuint8 fire.colorStop is the color value which, when reached, will cause the particle to disappear. The default value is 48 (pink).\nuint8 fire.size decides how large the oval will be, ranging from 0-3. The default value is 3.\n","full":"float xSpeedfloat xSpeed","type":"property","arguments":[]},{"name":"yPos","description":"Corresponds to PARTICLE::FLOWER. Flower particles are drawn as single color, partially transparent, rotationally symmetric flowers, and drift for a while while getting progressively smaller. They are traditionally created by setting Type=1 on a Snow event.\nuint8 flower.angle is the current angle of rotation the flower is drawn at.\nint8 flower.angularSpeed is how much the angle changes every tick, positive or negative. By default they do not rotate at all.\nuint8 flower.color is the color which a flower particle will be drawn as, and does not change during the particle's lifetime. The default value is 16 (green)\nuint8 flower.size is how large the flower should be drawn, though this is not equal to its size in actual pixels. Decreases by 1 every tick until it reaches 0, at which point the particle disappears. The default starting value is 64.\nuint8 flower.petals is the number of petals the flower has. The default value is 5.\n","full":"float yPosfloat yPos","type":"property","arguments":[]},{"name":"ySpeed","description":"uint8 flower.color is the color which a flower particle will be drawn as, and does not change during the particle's lifetime. The default value is 16 (green)\nuint8 flower.size is how large the flower should be drawn, though this is not equal to its size in actual pixels. Decreases by 1 every tick until it reaches 0, at which point the particle disappears. The default starting value is 64.\nuint8 flower.petals is the number of petals the flower has. The default value is 5.\n","full":"float ySpeedfloat ySpeed","type":"property","arguments":[]},{"name":"fire","description":"Corresponds to PARTICLE::ICETRAIL. Ice trail particles are drawn as single pixels. In regular JJ2, ice bullets leave them in their wake as they fly.\nuint8 icetrail.color is the color (palette entry) which an ice trail particle will be drawn as. This property gradually increases as the particle remains active, until it reaches colorStop (default 40, yellow), at which point the particle will disappear. The default initial value is 32 (light blue).\nint8 icetrail.colorDelta is the rate at which the color property is going to change. The most commonly used values for this are 1 and -1 meaning that the color value will respectively increase or decrease by 1 every time the game decides to modify it. The default value is 1.\nuint8 icetrail.colorStop is the color value which, when reached, will cause the particle to disappear. The default value is 40 (yellow).\n","full":"fire","type":"property","arguments":[]},{"name":"flower","description":"Corresponds to PARTICLE::PIXEL. Depending on their size value, pixel particles will be drawn as\t1x1, 2x2, or 3x3 rectangles of pixels. They move both horizontally and vertically, and will also bounce off of masks. These are the particles created by destroying most enemies.\nuint8 pixel.color[9] specifies which colors will be drawn at each pixel in the particle's rectangle. Note that if the rectangle is smaller than 3x3, not every number in the array will be used. Values of 0 represent transparent pixels and will therefore not be drawn.\nuint8 pixel.size specifies the size of the rectangle drawn to the screen. 0 for 1x1, 1 for 2x2, or any other number for 3x3. The default value is 0.\n","full":"flower","type":"property","arguments":[]},{"name":"icetrail","description":"uint8 snow.frame specifies which frame of the animation will be drawn. This remains constant until the particle hits a wall, at which point it will increase to 7 before disappearing. The default initial value is 0.\nuint16 snow.frameBase is ID of the frame the particle will use as a base sprite (curFrame-style), and has the default value of jjAnimations[jjAnimSets[ANIM::SNOW].firstAnim].firstFrame. The displayed frame will be equal to this property plus the current value of the frame property.\n","full":"icetrail","type":"property","arguments":[]},{"name":"leaf","description":"int8 star.angularSpeed is how much the angle changes every tick, positive or negative. By default they do not rotate at all.\nuint8 star.color is the color the star is drawn as. The default value is 40 (yellow).\nuint8 star.colorChangeCounter counts down to 0, at which point it resets to the value of the colorChangeInterval property and changes the color property to one of the sprite colors at random.\nuint8 star.colorChangeInterval is how many ticks the particle goes before changing colors again. If it is set to 0 (the default value), however, the color will never change.\nuint8 star.frame determines whether the star is filled (0) or only an outline (1). The default value is 0.\nuint8 star.size is how large the star is. It decreases over time until it hits 0, at which point the particle is deleted. The default value is 16.\n","full":"leaf","type":"property","arguments":[]},{"name":"pixel","description":"","full":"pixel","type":"property","arguments":[]},{"name":"rain","description":"","full":"rain","type":"property","arguments":[]},{"name":"smoke","description":"","full":"smoke","type":"property","arguments":[]},{"name":"snow","description":"","full":"snow","type":"property","arguments":[]},{"name":"spark","description":"","full":"spark","type":"property","arguments":[]},{"name":"star","description":"","full":"star","type":"property","arguments":[]},{"name":"string","description":"","full":"string","type":"property","arguments":[]},{"name":"tile","description":"","full":"tile","type":"property","arguments":[]}]